# Make it Easy : TAB Completion and Tooltip

In [1]:
import pandas as pd

In [2]:
#import libraries
import os

cWrkDir=os.getcwd()
print(cWrkDir)

C:\Users\ADMIN\Documents\DataScience\Python\Github\practice\Pandas tutorial

In [3]:
# lets set fileName which we have to read
rawFile='titanic.csv'

In [4]:
# lets search for all folders and sub folder under current directory to get the file path

for root, dir, files in os.walk(cWrkDir):
    for name in files:
        if name == rawFile:
            finalPath=os.path.abspath(os.path.join(root,name))
            print(finalPath)

C:\Users\ADMIN\Documents\DataScience\Python\Github\practice\Pandas tutorial\Course_Materials_Part1\Video_Lecture_NBs\titanic.csv

In [5]:
# lets read the file

df_titanic=pd.read_csv(finalPath)

In [6]:
df_titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [9]:
df_titanic.sort_values(by=['age'], ascending=False)

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
630         1       1    male  80.0      0      0  30.0000        S    A
851         0       3    male  74.0      0      0   7.7750        S  NaN
493         0       1    male  71.0      0      0  49.5042        C  NaN
96          0       1    male  71.0      0      0  34.6542        C    A
116         0       3    male  70.5      0      0   7.7500        Q  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]